Show / Hide Table of Contents
Class PlateData
Provides data of the single plate
Inheritance
System.Object
OpenObject
OpenElementId
PlateData
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
[DataContract]
public class PlateData : OpenElementId
Properties
Improve this Doc   View Source
AxisX
LCS - Axis X
Declaration
[DataMember]
public Vector3D AxisX { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
AxisY
LCS - Axis Y
Declaration
[DataMember]
public Vector3D AxisY { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
AxisZ
LCS - Axis Z
Declaration
[DataMember]
public Vector3D AxisZ { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
IsNegativeObject
Is negative object
Declaration
[DataMember]
public bool IsNegativeObject { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Material
Name of the material
Declaration
[DataMember]
public string Material { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Name
Name of the plate
Declaration
[DataMember]
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Origin
Origin of the plate LCS
Declaration
[DataMember]
public Point3D Origin { get; set; }
Property Value
 Type |  Description
 Point3D
Improve this Doc   View Source
OriginalModelId
Get or set the identification in the original model In the case of the imported connection from another application
Declaration
[DataMember]
public string OriginalModelId { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
OutlinePoints
Outline points
Declaration
[DataMember]
public List<Point2D> OutlinePoints { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Point2D>
Improve this Doc   View Source
Region
Geometry of the plate in svg format
Declaration
[DataMember]
public string Region { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Thickness
Thickness of the plate
Declaration
[DataMember]
public double Thickness { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source